In [51]:
import pandas as pd

In [52]:
df = pd.read_csv('data/Data.csv')

In [53]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [54]:
df.isna().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [55]:
df.dropna(inplace=True)
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [56]:
df.reset_index(inplace=True, drop=True) # 데이터 클리닝, 데이터를 깔끔하게
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4   France  35.0  58000.0       Yes
5   France  48.0  79000.0       Yes
6  Germany  50.0  83000.0        No
7   France  37.0  67000.0       Yes

In [57]:
df.loc[ : , ['Country', 'Salary']]

   Country   Salary
0   France  72000.0
1    Spain  48000.0
2  Germany  54000.0
3    Spain  61000.0
4   France  58000.0
5   France  79000.0
6  Germany  83000.0
7   France  67000.0

In [58]:
X = df.loc[:, :]

In [59]:
X

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4   France  35.0  58000.0       Yes
5   France  48.0  79000.0       Yes
6  Germany  50.0  83000.0        No
7   France  37.0  67000.0       Yes

In [60]:
# 각 컬럼별로 문자인지 숫자인지 먼저 확인.
# 문자열이면, 2종류인지 3종류 이상의 데이터인지
# 확인이 끝나면 레이블인코딩이나 원핫인코딩 이용해 숫자로

In [61]:
print(X['Country'].unique())
print(X['Purchased'].unique())

['France' 'Spain' 'Germany']
['No' 'Yes']

In [62]:
X.columns

Index(['Country', 'Age', 'Salary', 'Purchased'], dtype='object')

In [63]:
X.columns[0]

'Country'

In [64]:
df[X.columns[0]].dtype == object

True

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    8 non-null      object
 1   Age        8 non-null      float64
 2   Salary     8 non-null      float64
 3   Purchased  8 non-null      object
dtypes: float64(2), object(2)
memory usage: 384.0+ bytes

In [66]:
df.dtypes

Country       object
Age          float64
Salary       float64
Purchased     object
dtype: object

In [67]:
df[X.columns[1]].dtype == float

True

In [68]:
df[X.columns[0]].nunique()

3

In [69]:
# 데이터 종류가 3개인데 문자열로 이루어졌기 때문에 숫자로 변형.
# 원핫인코딩 사용.
# 원핫 인코딩은 한번에 여러 컬럼이 가능하므로,
# 먼저 레이블 인코딩이 가능한 컬럼 먼저 처리를 해주고 난 후에
# 원핫 인코딩을 수행한다.
from sklearn.preprocessing import LabelEncoder, OneHotEncoder
from sklearn.compose import ColumnTransformer

X.head(3)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No

In [70]:
for name in X.columns:
    # print(name)
    # print(X[name])

# 데이터가 문자열이면, 데이터의 종류가 몇개인지 확인한다.
    if X[name].dtype == object:
        if X[name].nunique() >= 3:
            # 원핫인코딩
            pass
        else:
            # 레이블 인코딩
            pass
    # 숫자 데이터일 때 처리는 여기서
    else:
        pass

In [71]:
sorted(X[X.columns[0]].unique()) # 정렬한 상태에서 원핫인코딩 하기.

['France', 'Germany', 'Spain']

In [72]:
# 1 0 0
# 0 1 0
# 0 0 1

In [73]:
# 바꾸려 하는거
X[X.columns[0]].to_frame
# .to_frame은 1차원 판다스 시리즈를 데이터프레임으로 변경하는거

<bound method Series.to_frame of 0     France
1      Spain
2    Germany
3      Spain
4     France
5     France
6    Germany
7     France
Name: Country, dtype: object>

In [74]:
ct = ColumnTransformer([('encoder', OneHotEncoder(), [0])], # encoder 말고도 아무거나 가능
                        remainder= 'passthrough')

In [75]:
ct.fit_transform(X[X.columns[0]].to_frame())

array([[1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 0., 1.],
       [1., 0., 0.],
       [1., 0., 0.],
       [0., 1., 0.],
       [1., 0., 0.]])

In [76]:
sorted(X[X.columns[0]].unique())

['France', 'Germany', 'Spain']

In [77]:
X[X.columns[3]].nunique()

2

In [78]:
labelencoder = LabelEncoder()

In [79]:
labelencoder.fit_transform(X[X.columns[3]])

array([0, 1, 0, 0, 1, 1, 0, 1])

In [86]:
X.columns.values

array(['Country', 'Age', 'Salary', 'Purchased'], dtype=object)

In [92]:
X_new = pd.DataFrame()
for name in X.columns: # 각 컬럼을 name으로 받아서 반복
    if X[name].dtype == object: # 문자열로 이뤄졌을 경우 데이터 종류 수 확인
        if X[name].nunique() >= 3: # 원핫 인코딩
            ct = ColumnTransformer([('encoder', OneHotEncoder(), [list(X.columns.values).index(name)])], 
                                    remainder= 'passthrough') # [0]열을 list.index로 특정
            col_names = sorted(X[name].unique())
            X_new[col_names] = ct.fit_transform( X[name].to_frame())

        else: # 레이블 인코딩
            label_encoder = LabelEncoder()
            X_new[name] = label_encoder.fit_transform(X[name])

    # 숫자 데이터일 때 처리는 여기서
    else:
        X_new[name] = X[name]

AttributeError: 'numpy.ndarray' object has no attribute 'where'

In [90]:
X

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4   France  35.0  58000.0       Yes
5   France  48.0  79000.0       Yes
6  Germany  50.0  83000.0        No
7   France  37.0  67000.0       Yes

In [91]:
X_new

   France  Germany  Spain   Age   Salary  Purchased
0     1.0      0.0    0.0  44.0  72000.0          0
1     0.0      0.0    1.0  27.0  48000.0          1
2     0.0      1.0    0.0  30.0  54000.0          0
3     0.0      0.0    1.0  38.0  61000.0          0
4     1.0      0.0    0.0  35.0  58000.0          1
5     1.0      0.0    0.0  48.0  79000.0          1
6     0.0      1.0    0.0  50.0  83000.0          0
7     1.0      0.0    0.0  37.0  67000.0          1